<?php
/**
 *  ==================================================================
 *        文 件 名: convention.php
 *        概    要: 事件定义
 *        作    者: IT小强
 *        创建时间: 2019-01-26 09:35:00
 *        修改时间:
 *        copyright (c) 2016 - 2019 mail@xqitw.cn
 *  ==================================================================
 */

$config = include __DIR__ . '/convention_think.php';

// +----------------------------------------------------------------------
// | 应用设置
// +----------------------------------------------------------------------

// URL普通方式参数 用于自动生成
$config['app']['url_common_param'] = true;


// +----------------------------------------------------------------------
// | URL及路由设置
// +----------------------------------------------------------------------

// 路由是否完全匹配
$config['app']['route_complete_match'] = true;

// +----------------------------------------------------------------------
// | 模板设置
// +----------------------------------------------------------------------
// 模板引擎普通标签开始标记
$config['template']['tpl_begin'] = '{{';
// 模板引擎普通标签结束标记
$config['template']['tpl_end'] = '}}';
// 标签库标签开始标记
$config['template']['taglib_begin'] = '{{';
// 标签库标签结束标记
$config['template']['taglib_end'] = '}}';

return $config;
